tutorials/of12/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
    {
        name    surpressedSet;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
        file		"flowChannel.stl";

	outsidePoints	((1e-3  11e-3 1e-3));
	//enable one of the following five
	nearDistance 	1e-6;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
	includeInside	false;			// pick all cells entirely within the geometry.stl
	includeOutside	yes;			// pick all cells entirely outside of geometry.stl
	includeCut	true;			// pick all cells intersected by geometry.stl
	curvature	-100;			//-100 means deactivated. No idea what it does.
    	}
    }

);





// ************************************************************************* //
